Repository: xinux-org/software-center
Catalog: po/*.po
Languages: uz

source: Some packages are unavailable!
uz: Ayrim paketlar mavjud emas!

source: If you continue this update, some packages will be removed
uz: Bu yangilanishda davom etsangiz, ayrim paketlar olib tashlanadi

source: User Packages
uz: Foydalanuvchi paketlari

source: System Packages
uz: Tizim paketlari

source: Cancel
uz: Bekor qilish

source: Continue
uz: Davom etish

source: Configuration file
uz: Konfiguratsiya fayli

source: Use nix flakes
uz: Nix flakes'dan foydalaning

source: Flake file
uz: Flake fayli

source: User (nix-env)
uz: Foydalanuvchi (nix-env)

source: User (nix profile)
uz: Foydalanuvchi (nix profile)

source: System (configuration.nix)
uz: Tizim (configuration.nix)

source: No internet connection
uz: Internetga ulanmagansiz

source: Please connect to the internet to update your system
uz: Tizimni yangilash uchun internetga ulaning

source: Refresh
uz: Yangilash

source: Updates
uz: Yangilanishlar

source: Update Everything
uz: Barchasini yangilash

source: Update All
uz: Hammasini yangilash

source: Update
uz: Yangilash

source: Everything is up to date!
uz: Hammasi yangi!

source: Development
uz: Ishlab chiqish

source: Games
uz: O‘yinlar

source: Graphics
uz: Grafika

source: Web
uz: Veb

source: Welcome the Nix Software Center!
uz: Nix dasturiy ta’minot markaziga xush kelibsiz!

source: If your configuration file is not in the default location, you can change it here.
uz: Agar konfiguratsiya faylingiz birlamchi joylashuvda boʻlmasa, uni bu yerda oʻzgartirishingiz mumkin.

source: If you are using flakes, you can specify the path to your flake.nix file here.
uz: Agar flakes ishlatayotgan bo‘lsangiz, bu yerda flake.nix fayliga yo‘lni ko‘rsatishingiz mumkin.

source: Building...
uz: Qurilmoqda...

source: Done!
uz: Tamom!

source: Rebuild successful!
uz: Qayta qurish muvaffaqiyatli yakunlandi!

source: Error!
uz: Xatolik!

source: Rebuild failed! See below for error message.
uz: Qayta tiklash muvaffaqiyatsiz tugadi! Xatolik haqidagi ma’lumot uchun pastga qarang.

source: Close
uz: Yopish

source: Unknown
uz: Noaniq

source: Open
uz: Ochish

source: Installed
uz: Oʻrnatilgan

source: Offline
uz: Oflayn

source: Install
uz: O‘rnatish

source: Homepage
uz: Bosh sahifa

source: Licenses
uz: Litsenziyalar

source: License
uz: Litsenziya

source: Platforms
uz: Platformalar

source: Maintainers
uz: Ta’minotchilar

source: Maintainer
uz: Ta’minotchi

source: Run without installing
uz: O‘rnatmasdan ishga tushirish

source: Open interactive shell
uz: Terminalda ochish

source: Nix Software Center
uz: Nix dasturiy ta'minot markazi

source: Loading...
uz: Yuklanmoqda...

source: Categories
uz: Toifalar

source: Recommended
uz: Tavsiya etiladi

source: Preferences
uz: Afzalliklar

source: About
uz: Haqida

source: Explore
uz: Kezish

source: NixOS System
uz: NixOS tizimi

source: NixOS internal packages and modules
uz: NixOS ichki paketlari va modullari
